test_harness/app/controllers/test_models_controller.rb

  def index
    @test_models = TestModel.all
---
SELECT "test_models".* FROM "test_models"

  def show
    @test_model = TestModel.find(params[:id])
---
SELECT "test_models".* FROM "test_models" WHERE ("test_models"."id" = 1) LIMIT 1

  def edit
    if request.post?
      test_models = []
      params[:test_model_id].each { |i| test_models << TestModel.find(i) }
---
SELECT "test_models".* FROM "test_models" WHERE ("test_models"."id" = 10) LIMIT 1

  def create
    @test_model = TestModel.new(params[:test_model])

    respond_to do |format|
      if @test_model.save
---
INSERT INTO "test_models" ("created_at", "name", "selectable_two", "weight", "selectable_one", "description", "updated_at") VALUES ('2011-03-24 01:50:33.782397', 'asfasd123r', '1', 123, 1, 'asdf23', '2011-03-24 01:50:33.782397')

  def update
    @test_model = TestModel.find(params[:id])
---
SELECT "test_models".* FROM "test_models" WHERE ("test_models"."id" = 10) LIMIT 1